Challenges repo/Day_4/gifts_api_app/app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts"
---
  def index
    render json: {status: 200, gifts: Gift.all}