Challenges repo/Day_6/dating_app/dating_app_api/app/controllers/users_controller.rb

  def index
    @users = User.all.sample(6)
    @users2= User.all.sample(6)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "starsign", "age", "img", "ltl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Disturbed"], ["starsign", "scorpio"], ["age", 43], ["img", ""], ["ltl", true], ["created_at", "2020-09-22 00:08:08.455339"], ["updated_at", "2020-09-22 00:08:08.455339"]]