Challenges repo/Day_3/books_app_api/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  render json: { status:200, books: Book.all }

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
  puts "=======params======"
  puts params
  puts "=======params======"
  @book = Book.find(params[:id])