Challenges repo/Day_7/temperatures/temperatures_api/app/controllers/temperatures_controller.rb

  def index
    @temperatures = Temperature.all
---
SELECT "temperatures".* FROM "temperatures"